vtk/Resolution_40/Case1/system/blockMeshDict
FoamFile
{
	format      ascii;
	class       dictionary;
	object      blockMeshDict;
}

convertToMeters 1;

vertices (
	(-0.0000223606797749979 0.0000447213595499958 0)
	(0.0000223606797749979 -0.0000447213595499958 0)
	(0.0020118033988749886 0.00095 0)
	(0.0018881966011250109 0.001 0)
	(0.0000223606797749979 0.002044721359549996 0)
	(-0.0000223606797749979 0.001955278640450004 0)
	(0.0020118033988749886 0.00105 0)
	(0.0022118033988749886 0.00105 0)
	(0.003988196601125011 0.00095 0)
	(0.003788196601125011 0.00105 0)
	(0.004111803398874989 0.001 0)
	(0.005977639320225003 -0.0000447213595499958 0)
	(0.006022360679774998 0.0000447213595499958 0)
	(0.003988196601125011 0.00105 0)
	(0.006022360679774998 0.001955278640450004 0)
	(0.005977639320225003 0.002044721359549996 0)
	(-0.0000223606797749979 0.0000447213595499958 0.0001)
	(0.0000223606797749979 -0.0000447213595499958 0.0001)
	(0.0020118033988749886 0.00095 0.0001)
	(0.0018881966011250109 0.001 0.0001)
	(0.0000223606797749979 0.002044721359549996 0.0001)
	(-0.0000223606797749979 0.001955278640450004 0.0001)
	(0.0020118033988749886 0.00105 0.0001)
	(0.0022118033988749886 0.00105 0.0001)
	(0.003988196601125011 0.00095 0.0001)
	(0.003788196601125011 0.00105 0.0001)
	(0.004111803398874989 0.001 0.0001)
	(0.005977639320225003 -0.0000447213595499958 0.0001)
	(0.006022360679774998 0.0000447213595499958 0.0001)
	(0.003988196601125011 0.00105 0.0001)
	(0.006022360679774998 0.001955278640450004 0.0001)
	(0.005977639320225003 0.002044721359549996 0.0001)
);

blocks (
	hex (0 1 2 3 16 17 18 19) (40 896 1) simpleGrading (1 1 1)
	hex (4 5 3 6 20 21 19 22) (40 896 1) simpleGrading (1 1 1)
	hex (6 2 8 13 22 18 24 29) (40 800 1) simpleGrading (1 1 1)
	hex (10 8 11 12 26 24 27 28) (40 896 1) simpleGrading (1 1 1)
	hex (13 10 14 15 29 26 30 31) (40 896 1) simpleGrading (1 1 1)
	hex (3 2 6 3 19 18 22 19) (40 40 1) simpleGrading (1 1 1)
	hex (10 13 8 10 26 29 24 26) (40 40 1) simpleGrading (1 1 1)
);

edges (
);

boundary (
	walls {
		type wall;
		faces (
			(1 2 17 18)
			(3 0 19 16)
			(5 3 21 19)
			(6 4 22 20)
			(2 8 18 24)
			(13 6 29 22)
			(8 11 24 27)
			(12 10 28 26)
			(10 14 26 30)
			(15 13 31 29)
		);
	}
	inlet_0 {
		type patch;
		faces (
			(0 1 16 17)
		);
	}
	inlet_1 {
		type patch;
		faces (
			(4 5 20 21)
		);
	}
	outlet_0 {
		type patch;
		faces (
			(11 12 27 28)
		);
	}
	outlet_1 {
		type patch;
		faces (
			(14 15 30 31)
		);
	}
);